sinricpro/esp8266-esp32-sdk/src/SinricProUDP.h
/*
 *  Copyright (c) 2019 Sinric. All rights reserved.
 *  Licensed under Creative Commons Attribution-Share Alike (CC BY-SA)
 *
 *  This file is part of the Sinric Pro (https://github.com/sinricpro/)
 */

#pragma once

#if defined(ESP8266)
  #include <ESP8266WiFi.h>
  #define SINRICPRO_UDP_LWIP
#elif defined(ESP32)
  #include <WiFi.h>
  #define SINRICPRO_UDP_ESP32
#elif defined(ARDUINO_ARCH_RP2040)
  #include <WiFi.h>
  #define SINRICPRO_UDP_LWIP
#endif

#include <WiFiUdp.h>
#include "SinricProQueue.h"
#include "SinricProConfig.h"
#include "SinricProDebug.h"

#include "SinricProNamespace.h"
namespace SINRICPRO_NAMESPACE {

class UdpListener {
  public:
    void              begin(SinricProQueue_t* receiveQueue);
    void              handle();
    void              sendMessage(String &message, const IPAddress& remoteIP, uint16_t remotePort);
    void              stop();

  private:
    WiFiUDP           _udp;
#ifdef SINRICPRO_UDP_LWIP
    WiFiUDP           _udpTx;
#endif
    SinricProQueue_t* receiveQueue;
};

void UdpListener::begin(SinricProQueue_t* receiveQueue) {
  this->receiveQueue = receiveQueue;
#if defined(SINRICPRO_UDP_LWIP)
  _udp.beginMulticast(WiFi.localIP(), UDP_MULTICAST_IP, UDP_MULTICAST_PORT);
#elif defined(SINRICPRO_UDP_ESP32)
  _udp.beginMulticast(UDP_MULTICAST_IP, UDP_MULTICAST_PORT);
#endif
}

void UdpListener::handle() {
  int len = _udp.parsePacket();
  if (!len) return;

  char* buf = (char*) malloc(len + 1);
  if (!buf) return;
  memset(buf, 0, len + 1);
  _udp.read(buf, len);
  SinricProMessage* request = new SinricProMessage(IF_UDP, buf, _udp.remoteIP(), _udp.remotePort());
  DEBUG_SINRIC("[SinricPro:UDP]: receiving request\r\n%s\r\n", buf);
  free(buf);
  receiveQueue->push(request);
}

void UdpListener::sendMessage(String &message, const IPAddress& remoteIP, uint16_t remotePort) {
  if (!remotePort) {
    DEBUG_SINRIC("[SinricPro:UDP]: message has no peer to answer, dropping\r\n");
    return;
  }
#if defined(SINRICPRO_UDP_LWIP)
  _udpTx.beginPacket(remoteIP, remotePort);
  _udpTx.print(message);
  _udpTx.endPacket();
#elif defined(SINRICPRO_UDP_ESP32)
  _udp.beginPacket(remoteIP, remotePort);
  _udp.print(message);
  _udp.endPacket();
#else
  (void)message;
  (void)remoteIP;
#endif
}

void UdpListener::stop() {
  _udp.stop();
#ifdef SINRICPRO_UDP_LWIP
  _udpTx.stop();
#endif
}

} // SINRICPRO_NAMESPACE
